
class Config():
    def __init__(self):
        self.vector_db_path = "./full_turn_rag_db"  # 向量库本地存储路径
        self.device = 'cpu'
        self.max_history_length = 30
        self.base_path = './images'
        self.api_url = "http://101.33.211.254:6888/chat"
        self.system_prompt = {"role": "system", "content": f"1. 你是皮肤病诊断助手，普通对话直接回答，需工具时调用函数，一次可以调用多个工具。"+\
     "2. 用户传入图像时调用多模态大模型工具"+\
     f"3. 首轮对话先读取用户的个人信息"+\
     '4. 用户进行皮肤病相关诊断前先查一下他的过往的诊断记录，诊断后为他生成一个病历并保存下来'+\
        '5. 将所有皮肤病相关的信息比如过敏史,症状,以及多模态的诊断结果整理后保存下来'+\
        '6. 必须及时更新用户信息,比如记录中有冲突或者过时的记录就及时更新或者删除'+\
        '7. 信息冲突时若无法判断去留可以向用户确认'+\
        '8. 重点:给用户指定完善的皮肤调理计划,跟踪恢复过程'
        '9. 完整的皮肤病诊断流程如下:1)读取用户个人信息,有则继续,无则记录.2)调用多模态大模型后,保存用户上传的照片的路径以及照片的相关描述和症状,制定详尽的计划'+\
        '3)之后持续跟踪用户的计划执行进度,将用户最新照片和之前的照片传给多模态大模型进行对比,结合用户感受描述决定是否更新计划,同时记录进度'
        }

	


# VECTOR_DB_PATH = "./full_turn_rag_db"  # 向量库本地存储路径
# DEVICE='cpu'
# MAX_HISTORY_LENGTH = 20

# #多模态配置
# API_URL = "http://134.175.128.138:6888/chat"
# IMAGE_PATH = '14.png'
# #端口转发
# #ssh -L 8888:localhost:6888 ubuntu@	175.178.7.40
# #password:  7|9YMzr?N-Hpx
# #http://localhost:8888/chat
# #C:/Users/z4538/miniconda3/envs/agent/Scripts/streamlit.exe run app.py

# SYSTEM_PROMPT = {"role": "system", "content": f"1. 你是皮肤病诊断助手，普通对话直接回答，需工具时调用函数，一次可以调用多个工具。"+\
#      "2. 你可以随时查询所有用户的信息，但是严格禁止透露用户的信息给其他用户。"+\
#      f"3. 首轮对话先读取用户的个人信息"+\
#      '4. 用户进行皮肤病相关诊断前先查一下他的过往的诊断记录，诊断后为他生成一个病历并保存下来'+\
#         '5. 记录详细的用户个人信息,从他的对话中推断他的个性和爱好等,用于后续提供更加合理的回答'+\
#         '6. 必须及时更新用户信息,比如记录中有冲突或者过时的记录就及时更新或者删除'
#         }